Revit 2024 API
ScheduleDefinition.IsEmbedded Property
 Indicates if this is an embedded ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsEmbedded { get; }
Visual Basic
Public ReadOnly Property IsEmbedded As Boolean
	Get
Visual C++
public:
property bool IsEmbedded {
	bool get ();
}
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace